app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", ""]]

  def update
    if password_blank?
      flash.now[:danger] = "Password can't be blank"
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$/IbKWkBj5i0SmRoG0iMdAuvegu6QMCA/RVvgu6Xz.5trs.pilfr4a"], ["updated_at", "2016-02-08 19:19:44.668503"], ["id", 762146111]]